Управление оповещениями в Firefox для Android
=============
В мобильном приложении Firefox для Android вы можете получать оповещения от сайтов и менять их настройки под свои нужды.

Как работают оповещения
-------------

По умолчанию браузер Firefox отправляет оповещения от сайтов только после вашего разрешения, которое в дальнейшем можно будет изменить в любой момент.
![](https://sun9-56.userapi.com/c854524/v854524522/af597/Z3keVeajSBg.jpg)

> ### В режиме инкогнито оповещения не приходят

Как включить или отключить оповещения для всех сайтов
-------------
1. Откройте приложение Firefox ![](https://sun9-20.userapi.com/c852020/v852020522/19fa04/pO9PZFWYjGs.jpg) на Android устройстве
2. Справа от адресной строки нажмите на значок «Ещё» ![](https://sun9-46.userapi.com/c852020/v852020522/19fa0b/CrPCHSQvMjU.jpg) ![](https://sun9-39.userapi.com/c852020/v852020522/19fa12/qJovwI_Sb0w.jpg) «Параметры»
3. Перейдите в «Уведомления» ![](https://sun9-39.userapi.com/c852020/v852020522/19fa12/qJovwI_Sb0w.jpg) «Управление настройками уведомлений»
4.	Установите переключатель в нужное положение

Как включить оповещения для определенных сайтов
-------------
1. Откройте приложение Firefox ![](https://sun9-20.userapi.com/c852020/v852020522/19fa04/pO9PZFWYjGs.jpg) на Android устройстве
2. В адресной строке введите ссылку или название нужного вам сайта
3. В появившемся окне нажмите «Всегда», чтобы получать оповещения от сайта

Как выключить оповещения для определенных сайтов
-------------
1. Откройте приложение Firefox ![](https://sun9-20.userapi.com/c852020/v852020522/19fa04/pO9PZFWYjGs.jpg) на Android устройстве
2. В адресной строке введите ссылку или название нужного вам сайта
3. Нажмите на значок настроек сайта (замок)
4. Перейдите на «Изменить параметры сайта»
5. Установите галочку рядом с Уведомления, затем нажмите Очистить, чтобы выключить уведомления
